"""[Midterm] Books"""
def main():
    """[Midterm] Books"""
    import math
    book = int(input())
    page = int(input())
    num_x = int(input())
    num_y = int(input())
    count = 0
    page_s = page
    day = 0
    if book > 0:
        book -= 1
        while page > 0:
            page -= math.ceil(page_s * ((num_x + count)/(num_y + count)))
            day += 1
            if math.ceil(page_s * ((num_x + count)/(num_y + count))) >= page_s:
                day += book
                break
            if page <= 0 and book >= 1:
                book -= 1
                page = page_s
            count += 1
    print(day)
main()

# มีหนังสืออยู่ทั้งหมด n เล่ม แต่ละเล่มมีจำนวนหน้าที่เท่ากันคือ k หน้า
# เมื่อมีค่าจำนวนเต็มบวก x และ y มาให้ โดยที่ x <= y เสมอ
# นาย Harry จะอ่านหนังสือตามข้อกำหนดเหล่านี้

# 1. วันแรก อ่าน x/y ของเล่ม จำนวนหน้าปัดเศษขึ้นให้ครบหน้า
# 2. วันที่สอง อ่าน (x+1)/(y+1) ของเล่ม จำนวนหน้าปัดเศษขึ้นให้ครบหน้า
# 3. วันที่สาม อ่าน (x+2)/(y+2) ของเล่ม จำนวนหน้าปัดเศษขึ้นให้ครบหน้า
# ...
# ...
# ไปเรื่อยๆจนครบทุกหน้าของเล่มนั้น
# 4. อ่านวันละเล่มเท่านั้น (จะขึ้นเล่มใหม่ในวันถัดไป)
# 5. วันที่ขึ้นเล่มใหม่ อ่านตามด้วยสัดส่วนที่กำหนดต่อจากวันที่แล้ว เช่น สมมุติว่าอ่านเล่มแรกจบด้วยการอ่าน (x+m/y+m) หน้า วันถัดไปก็จะอ่านเล่มที่สอง จำนวน (x+m+1/y+m+1) ของเล่ม และ (x+m+2)/(x+m+2) ของเล่มในวันต่อไป แบบนี้ไปเรื่อยๆจนอ่านครบทุกเล่ม

# จงหาว่านาย Harry จะต้องใช้เวลาอ่านหนังสือกี่วันให้หมดครบ n เล่ม
# by นายเชาว์วัฒน์ ยาทองชุน
# 22 September 2021, 00:05
#  Specification
#  Input Specification	 Output Specification

# มี 4 บรรทัด
# บรรทัดที่ 1 ค่า n จำนวนเล่ม จำนวนเต็มบวกหรือศูนย์
# บรรทัดที่ 2 ค่า k จำนวนหน้าในแต่ละเล่ม จำนวนเต็มบวก
# บรรทัดที่ 3 ค่า x จำนวนเต็มบวก
# บรรทัดที่ 4 ค่า y จำนวนเต็มบวก
 

# มี 1 บรรทัด จำนวนวันที่ต้องใข้ในการอ่านหนังสือให้ครบทุกเล่มทุกหน้า ตามข้อกำหนดที่ระบุไว้
#  Sample Case
#  Sample Input	 Sample Output
# 1
# 50
# 1
# 5
# 4
# 100
# 20
# 3
# 5
# 118
# 10
# 90
# 2
# 3
# 20