"""[Midterm] PhoneNumber"""
def main():
    """[Midterm] PhoneNumber"""
    phonestr = str(input())
    kind = input()
    lenght = len(phonestr)
    if kind == "Domestic":
        if lenght == 9:
            print(phonestr[0], phonestr[1:5], phonestr[5:10])
        elif lenght == 10:
            print(phonestr[0:2], phonestr[2:6], phonestr[6:11])
    if kind == "International":
        if lenght == 10:
            print("+66"+phonestr[1], phonestr[2:6], phonestr[6:11]) #เริ่มที่ 7 จบที่ 11
        elif  lenght == 9:
            print("+66", phonestr[1:5], phonestr[5:10])
main()

# วิธีการเขียนหมายเลขโทรศัพท์ที่ถูกต้องคือ ให้เว้นวรรคทุกๆตัวเลข 4 หลัก นับจากข้างหลัง ยกตัวอย่าง เช่น

# 1. วิธีการเขียนเบอร์โทรศัพท์บ้านในกรุงเทพ ของหมายเลข 021234567 ที่ถูกต้องให้เขียนดังนี้ 

# ถ้าสำหรับใช้ภายในประเทศให้เขียน 0 2123 4567  ถ้าแจ้งชาวต่างชาติ ต้องเพิ่มรหัสประเทศ +66 2123 4567

# 2. วิธีการเขียนเบอร์โทรศัพท์เบอร์มือถือ  0811234567 ที่ถูกต้องให้เขียนดังนี้ 

# ถ้าสำหรับใช้ภายในประเทศไทยให้เขียน 08 1123 4567  ถ้าแจ้งชาวต่างชาติ ต้องเพิ่มรหัสประเทศ +668 1123 4567

# 3. วิธีการเขียนเบอร์โทรศัพท์เบอร์บ้านเชียงใหม่ 053123456 ที่ถูกต้องให้เขียนดังนี้ 

# ถ้าสำหรับใช้ภายในประเทศไทยให้เขียน 0 5312 3456   ถ้าแจ้งชาวต่างชาติ ต้องเพิ่มรหัสประเทศ  +66 5312 3456

# ให้หมายเลขโทรศัพท์มา และรูปแบบที่กำหนดมาว่าเป็น Domestic (ในประเทศ) หรือ International (ต่างประเทศ)

# จงเขียนในรูปแบบที่กำหนด 
#  Specification
#  Input Specification	 Output Specification

# มี 2 บรรทัด
# บรรทัดแรก หมายเลขโทรศัพท์ เป็นตัวเลขจำนวน 9 หลัก หรือ 10 หลัก เท่านั้น โดยหลักแรกเป็นเลข 0 เสมอ
# บรรทัดที่ 2 เป็นคำว่า Domestic หรือ International อย่างใดอย่างหนึ่ง

# หมายเลขโทรศัพท์ที่ถูกต้องตามรูปแบบที่กำหนด
#  Sample Case
#  Sample Input	 Sample Output

# 021234567
# Domestic
# 0 2123 4567

# 0811234567
# International
# +668 1123 4567

# 053123456
# International
# +66 5312 3456