"""[Midterm] Diginity"""
def main():
    """[Midterm] Diginity"""
    check_1 = 0
    check_2 = True
    while check_2 == True:
        loop_check = True
        number = str(input())
        if number == "0":
            check_2 = False
        else:
            while loop_check == True:
                for i in number:
                    check_1 += int(i)
                if check_1 < 10:
                    print(check_1)
                    check_1 = 0
                    loop_check = False
                else:
                    number = str(check_1)
                    check_1 = 0
main()

# การแลกเปลี่ยนโค้ดลับแบบพื้นฐาน เพื่อยืนยันฝ่ายเดียวกันของสมาคมโต๊ะกลม มีดังนี้

# จะต้องใช้เลขตัวหนึ่งตัว ที่หาผลรวมของตัวเลขโดดทุกหลักไปเรื่อยๆ จนกว่าจะเหลือเลขเพียงหลักเดียว จะได้เลขลับมา
# เช่น

# 47
# ผลรวมของวิธีข้างต้นจะเป็น 4 + 7 = 11 ; 11 ยังเป็นสองหลักอยู่จะต้องทำแบบเดินอีกครั้ง ; 1 + 1 = 2 ; คำตอบคือสอง
# สมาชิกทุกคนจะมี RFID Card เป็นบัตรประจำตัว และมีเลขของตัวเอง (เช่น 47)
# หัวหน้ากลุ่มต้องการที่จะทำประตูระบบรักษาความปลอดภัยโดยที่จะต้องให้สมาชิกเอาบัตรแตะเครื่องอ่านบัตร
# แล้วเครื่องอ่านบัตรจะเอาเลขไปคำนวณ ถ้าเลขผลลัพธ์ออกมาตรงตามที่ตั้งค่า ประตูจะเปิด ไม่เช่นนั้นจะมีสัญญาณเตือนภัยดังขึ้นทั่วตึกโต๊ะกลม

# งานของคุณคือเขียนโปรแกรมรับค่าเลขของบัตรสมาชิก และ คำนวณผลลัพธ์ออกมา
 
# by นายเชาว์วัฒน์ ยาทองชุน
# 22 September 2021, 00:13
#  Specification
#  Input Specification	 Output Specification

# หลายบรรทัด แต่ละบรรทัดคือเลขบัตรสมาชิก คนละหนึ่งบรรทัดเป็นจำนวนเต็มบวก
# โปรแกรมจะหยุดทำงานก็ต่อเมื่อได้รับเลข 0 เข้ามา (ไม่ต้องเอา 0 บรรทัดสุดท้ายไปคำนวณ)

# หลายบรรทัด แต่ละบรรทัดคือ ผลลัพธ์ของการคำนวณ เป็นเลขโดด 1 ตัวเท่านั้น
#  Sample Case
#  Sample Input	 Sample Output
# 2
# 11
# 47
# 1234567892
# 999999998
# 0
# 2
# 2
# 2
# 2
# 8

# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8
# 9
# 10
# 0
# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8
# 9
# 1