"""[Midterm] Stamps"""
def main():
    """[Midterm] Stamps"""
    terms = int(input())
    bill = int(input())
    get = int(input())
    need = int(input())
    pro = int(input())
    stamp = 0
    total = 0
    for _ in range(terms):
        price = int(input())
        while stamp >= need and price > 0 and pro != 0:
            stamp -= need
            price -= pro
        if price <= 0:
            price = 0
        total += price
        if price >= bill:
            stamp += price // bill * get
    print(total)
    print(stamp)
main()

# ร้านอาหารแห่งหนึ่งมี promotion ดังนี้

# 1. ทานอาหารและเครื่องดื่ม ในแต่ละครั้ง (bill) ครบทุกๆ a บาท (หลังหักส่วนลด ถ้ามี) จะได้แสดมป์สะสม b ดวง
# 2. สะสมแสตมป์ครบทุกๆ c ดวง สามารถนำไปเป็นส่วนลดในการทานอาหารและเครื่องดื่มครั้งต่อไป d บาท (แสตมป์ที่เกิดขึ้นจากค่าใช้จ่ายในครั้งนี้ ไม่สามารถนำมาลดเป็นส่วนลดในครั้งนี้ได้)
# 3. แสตมป์ที่มีอยู่ถ้าสามารถใช้เป็นส่วนลดได้ จะต้องใช้เลยในครั้งต่อไป ลูกค้าไม่มีสิทธิปฏิเสธขอไม่ใช้ส่วนลดในครั้งใดๆได้ (ถ้ามีส่วนลดที่สามารถใช้ลดได้ ให้ใช้ลดให้หมด)
# 4. หากส่วนลดมีมากกว่าค่าอาหารที่ต้องจ่าย ไม่สามารถเก็บส่วนต่างไว้เป็นส่วนลดในครั้งต่อๆไปได้ เช่น สมมุติว่ามีแสดมป์อยู่ 10 ดวง ทุกๆ 2 ดวงได้ส่วนลด 50 บาท ถ้าครั้งต่อไปไปทานอาหารและเครื่องตื่มรวมกัน 40 บาท จะต้องเสียแสดมป์ 2 ดวง มูลค่า 50 บาททันที (ไม่สามารถปฏิเสธการใช้แสตมป์ได้ตามข้อ 3) เท่ากับว่าทานอาหารและเครื่องดื่มครั้งนี้ไม่ต้องจ่ายเลย แต่แสดมป์จะเหลือ 8 ดวง และส่วนต่างของส่วนลดที่มากกว่าค่าอาหาร 10 บาท ไม่สามารถเก็บไปใช้ต่อได้

# ถ้ามีลูกค้ารายหนึ่งรับประทานอาหารเป็นจำนวน n ครั้ง และมีรายการค่าใช้จ่าย bill (ก่อนหักส่วนลด) ทั้ง n ครั้ง จงหาว่าลูกค้าจ่ายเงินไปจริงๆ (หลังหักส่วนลดแล้ว) รวมเป็นจำนวนทั้งหมดกี่บาท และมีแสดมป์เหลือที่ยังไม่ได้ใช้อีกทั้งหมดกี่ดวง
#  Specification
#  Input Specification	 Output Specification

# บรรทัดที่ 1: จำนวนครั้งไปที่ไปทานอาหารและเครื่องดื่มที่ร้านนี้ (n) เป็นจำนวนเต็มบวกหรือศูนย์
# บรรทัดที่ 2: ค่า a เป็นจำนวนเต็มบวก
# บรรทัดที่ 3: ค่า b เป็นจำนวนเต็มบวกหรือศูนย์
# บรรทัดที่ 4: ค่า c เป็นจำนวนเต็มบวก
# บรรทัดที่ 5: ค่า d เป็นจำนวนเต็มบวกหรือศูนย์
# บรรทัดที่ 6 ถึง บรรทัดที่ n+5 เป็นราคาค่าอาหารและเครื่องดื่มก่อนหักส่วนลดในแต่ละครั้ง ตั้งแต่ครั้งที่ 1 ถึงครั้งที่ n เป็นจำนวนเต็มบวก

# 3
# 300
# 1
# 1
# 20
# 100
# 300
# 200
# 580
# 0
# 5

# 300
# 1
# 2
# 50
# 400
# 700
# 30
# 590
# 100
# 1740
# 0
